In [1]:
#1 Importing Pandas and asssignig the pandas as pd
import pandas as pd

In [2]:
#2 Loading CSV file into the dataframe.
#Read the file named grades
df1 = pd.read_csv('grades.csv')

In [3]:
#3 Viewing the first 10 rows of the data from the dataframe df1
print(df1.head(10))

   ID                 Name   GPA              Major
0  23            Rose Rios  3.97          Economics
1  55            Ian Brown  1.44  Political Science
2  54         Stanley Dean  3.75         Philosophy
3  19  Stephanie Henderson  1.86        Mathematics
4  81          Angela Mora  3.86            Physics
5  60          Mark Martin  1.47          Chemistry
6  47     Jennifer Perkins  2.88            English
7  11      William Stewart  1.27            Biology
8  34           Eric Moore  3.40            Spanish
9  70      Kenneth Rollins  2.37                Art

In [4]:
#4 Viewing the bottom 10 rows of the data from the dataframe df1
print(df1.tail(10))

     ID                 Name   GPA        Major
94   20          Diane Brown  1.73  Mathematics
95   41     Brenda Valentine  3.10      Physics
96   86        Grace Hoffman  1.30    Chemistry
97   10          Joshua Ware  3.29      English
98   61  Ms. Samantha Steele  2.56      Spanish
99   22            Lisa Chen  1.45          Art
100  96         Jamie Knight  1.65     Business
101  95       Karen Williams  1.16     Business
102  80   Carrie Trujillo MD  1.44      Theatre
103  58         Renee Austin  2.60     Business

In [6]:
#5 Displaying the basic summary statistics from the dataset grades
df1.describe()

               ID         GPA
count  104.000000  104.000000
mean    51.721154    2.447115
std     29.253979    0.827750
min      1.000000    1.030000
25%     26.750000    1.657500
50%     52.500000    2.465000
75%     77.250000    3.132500
max    100.000000    3.970000

In [9]:
#6 Checking for number of duplicate rows in the dataframe
duplicate_count = df1.duplicated().sum()
print(duplicate_count)

#Displaying the dupicate rows if there are any of them
duplicated_rows = df1[df1.duplicated()]
duplicated_rows

4

     ID                Name   GPA     Major
100  96        Jamie Knight  1.65  Business
101  95      Karen Williams  1.16  Business
102  80  Carrie Trujillo MD  1.44   Theatre
103  58        Renee Austin  2.60  Business

In [11]:
#7 Droping those 4 duplicate rows from the dataset
df1.drop_duplicates(inplace=True)

In [13]:
#8 Checking for the missing values in each rows
print(df1.isnull().sum())

#Droping those missing values rows from the dataset
df1.dropna(inplace=True)
print(df1.isnull().sum())

ID       0
Name     0
GPA      0
Major    0
dtype: int64
ID       0
Name     0
GPA      0
Major    0
dtype: int64

In [15]:
#9 Creating a column named “Honor Student” and putting a “Yes” if their GPA exceeds 3.5 and a “No” if it doesn’t
def honor_student(gpa):
    if gpa > 3.5:
        return "Yes"
    else:
        return "No"
df1['Honor Student'] = df1['GPA'].map(honor_student)

#Viewing the dataframe with the column "Honor Student" 
print(df1)

    ID                 Name   GPA              Major Honor Student
0   23            Rose Rios  3.97          Economics           Yes
1   55            Ian Brown  1.44  Political Science            No
2   54         Stanley Dean  3.75         Philosophy           Yes
3   19  Stephanie Henderson  1.86        Mathematics            No
4   81          Angela Mora  3.86            Physics           Yes
..  ..                  ...   ...                ...           ...
95  41     Brenda Valentine  3.10            Physics            No
96  86        Grace Hoffman  1.30          Chemistry            No
97  10          Joshua Ware  3.29            English            No
98  61  Ms. Samantha Steele  2.56            Spanish            No
99  22            Lisa Chen  1.45                Art            No

[100 rows x 5 columns]

In [17]:
#10 Loading an excel file named “tuition” into a dataframe called “df2”
df2 = pd.read_excel('tuition.xlsx')

In [18]:
#11 Checking dataframe 2 i.e. df2 for duplicate rows if they exist
duplicate_count = df2.duplicated().sum()
print(duplicate_count)

#Displaying the dupicate rows if there are any of them
duplicated_rows = df2[df2.duplicated()]
duplicated_rows

1

     ID        Name State Resident  Tuition  Financial Aid
100   4  Eric Ellis             No  30000.0          12978

In [19]:
#12 Droping that one duplicate row from the dataframe 2
df2.drop_duplicates(inplace=True)

In [20]:
#13 Checking the missing values in each rows from the dataframe 2
print(df2.isnull().sum())

#Droping those missing values rows from the dataframe 2
df2.dropna(inplace=True)
print(df2.isnull().sum())

ID                0
Name              0
State Resident    2
Tuition           2
Financial Aid     0
dtype: int64
ID                0
Name              0
State Resident    0
Tuition           0
Financial Aid     0
dtype: int64

In [30]:
#14 Creating a column called “Cost” that is the result of subtracting financial aid from tuition.
df2['Cost'] = df2['Tuition'] - df2['Financial Aid']

#Viewing the dataframe with the new column "Cost"
print(df2)

    ID                 Name State Resident  Tuition  Financial Aid     Cost
0   17      Alexandra Green            Yes  20000.0           5180  14820.0
1   18      Alexandra Green             No  30000.0           7087  22913.0
2   81          Angela Mora            Yes  20000.0          12031   7969.0
3   57    Angela Oneill DDS            Yes  20000.0           7064  12936.0
4    2     Anthony Martinez            Yes  20000.0           6479  13521.0
..  ..                  ...            ...      ...            ...      ...
95  90  Stephanie Stevenson            Yes  20000.0          13431   6569.0
96  42         Summer Baker            Yes  20000.0          12094   7906.0
97  43          Tamara Lowe            Yes  20000.0           5761  14239.0
98  78     William Caldwell             No  30000.0          10663  19337.0
99  11      William Stewart            Yes  20000.0           9349  10651.0

[98 rows x 6 columns]

In [31]:
#15 Merging the two dataframes using the full join on the "ID" Column
df3 = pd.merge(df1, df2, on="ID", how="outer")

#Displaying the merged dataframe
print(df3)

    ID               Name_x   GPA              Major Honor Student  \
0   23            Rose Rios  3.97          Economics           Yes
1   55            Ian Brown  1.44  Political Science            No
2   54         Stanley Dean  3.75         Philosophy           Yes
3   19  Stephanie Henderson  1.86        Mathematics            No
4   81          Angela Mora  3.86            Physics           Yes
..  ..                  ...   ...                ...           ...
95  41     Brenda Valentine  3.10            Physics            No
96  86        Grace Hoffman  1.30          Chemistry            No
97  10          Joshua Ware  3.29            English            No
98  61  Ms. Samantha Steele  2.56            Spanish            No
99  22            Lisa Chen  1.45                Art            No

                 Name_y State Resident  Tuition  Financial Aid     Cost
0             Rose Rios            Yes  20000.0        11038.0   8962.0
1             Ian Brown            Yes  20000.0         6977.0  13023.0
2          Stanley Dean            Yes  20000.0        11481.0   8519.0
3                   NaN            NaN      NaN            NaN      NaN
4           Angela Mora            Yes  20000.0        12031.0   7969.0
..                  ...            ...      ...            ...      ...
95     Brenda Valentine             No  30000.0         9915.0  20085.0
96        Grace Hoffman             No  30000.0        12102.0  17898.0
97          Joshua Ware             No  30000.0        11174.0  18826.0
98  Ms. Samantha Steele             No  30000.0        13103.0  16897.0
99            Lisa Chen             No  30000.0         9901.0  20099.0

[100 rows x 10 columns]

In [32]:
#16 Checking for the  missing values and droping the rows
print(df3.isnull().sum())

df3.dropna(inplace=True)
print(df3.isnull().sum())

ID                0
Name_x            0
GPA               0
Major             0
Honor Student     0
Name_y            2
State Resident    2
Tuition           2
Financial Aid     2
Cost              2
dtype: int64
ID                0
Name_x            0
GPA               0
Major             0
Honor Student     0
Name_y            0
State Resident    0
Tuition           0
Financial Aid     0
Cost              0
dtype: int64

In [38]:
#17 Grouping the students by major and displaying the mean GPA and mean cost
df3.groupby(['Major']).aggregate({'GPA':['mean'],'Cost':['mean']})

                        GPA          Cost
                       mean          mean
Major
Art                2.760000  11472.125000
Biology            2.586667  13674.111111
Business           2.051667  12010.666667
Chemistry          2.652000  13750.800000
Economics          3.970000   8962.000000
English            2.658000  12958.000000
History            2.567273  11793.636364
Mathematics        1.640000  14377.600000
Philosophy         2.701667  13188.333333
Physics            2.345000  13250.750000
Political Science  1.440000  13023.000000
Spanish            2.258333  10735.000000
Theatre            2.322857  11180.714286

In [39]:
#18 Filtering everyone with GPA below 2.0 from the dataframe df3
df3[df3['GPA'] > 2.0]

,ID,Name_x,GPA,Major,Honor Student,Name_y,State Resident,Tuition,Financial Aid,Cost
0,23,Rose Rios,3.97,Economics,Yes,Rose Rios,Yes,20000.0,11038.0,8962.0
2,54,Stanley Dean,3.75,Philosophy,Yes,Stanley Dean,Yes,20000.0,11481.0,8519.0
4,81,Angela Mora,3.86,Physics,Yes,Angela Mora,Yes,20000.0,12031.0,7969.0
6,47,Jennifer Perkins,2.88,English,No,Jennifer Perkins,Yes,20000.0,14608.0,5392.0
8,34,Eric Moore,3.40,Spanish,No,Eric Moore,Yes,20000.0,10785.0,9215.0
...,...,...,...,...,...,...,...,...,...,...
92,65,Christopher Hernandez,2.08,History,No,Christopher Hernandez,No,30000.0,9378.0,20622.0
93,78,William Caldwell,2.79,Philosophy,No,William Caldwell,No,30000.0,10663.0,19337.0
95,41,Brenda Valentine,3.10,Physics,No,Brenda Valentine,No,30000.0,9915.0,20085.0
97,10,Joshua Ware,3.29,English,No,Joshua Ware,No,30000.0,11174.0,18826.0
98,61,Ms. Samantha Steele,2.56,Spanish,No,Ms. Samantha Steele,No,30000.0,13103.0,16897.0

In [40]:
#19 Sorting by ID in a descending order
ID_Desc = df3.sort_values('ID', ascending=False)
print(ID_Desc)

     ID                Name_x   GPA        Major Honor Student  \
80  100    Lawrence Rodriguez  2.66      Theatre            No
67   99  Mrs. Mary Sampson MD  3.43          Art            No
11   98        Donald Blevins  3.52      Theatre           Yes
74   97          Linda Dalton  1.30      Spanish            No
29   96          Jamie Knight  1.65     Business            No
..  ...                   ...   ...          ...           ...
63    5        Chelsea Flores  3.01    Chemistry            No
46    4            Eric Ellis  1.20  Mathematics            No
38    3         Shawn Gilbert  1.85     Business            No
77    2      Anthony Martinez  2.86      History            No
51    1          Nicole Allen  3.17      Biology            No

                  Name_y State Resident  Tuition  Financial Aid     Cost
80    Lawrence Rodriguez            Yes  20000.0        13674.0   6326.0
67  Mrs. Mary Sampson MD            Yes  20000.0         8653.0  11347.0
11        Donald Blevins            Yes  20000.0        12147.0   7853.0
74          Linda Dalton            Yes  20000.0        11388.0   8612.0
29          Jamie Knight             No  30000.0         9843.0  20157.0
..                   ...            ...      ...            ...      ...
63        Chelsea Flores            Yes  20000.0         9534.0  10466.0
46            Eric Ellis             No  30000.0        12978.0  17022.0
38         Shawn Gilbert            Yes  20000.0        14750.0   5250.0
77      Anthony Martinez            Yes  20000.0         6479.0  13521.0
51          Nicole Allen            Yes  20000.0         9677.0  10323.0

[98 rows x 10 columns]

In [41]:
#20 Exporting df3 as a CSV file
df3.to_csv('output.csv',index=False)

In [42]:
#Exporting df3 as an Excel file
df3.to_excel('output.xlsx',index=False)